/*
 * Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви).
 * Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.
 */
#include <iostream>

using namespace std;

int main () {
    int x;
    int n, m;
    int matrix[100][100];
    cin >> x;
    cin >> n >> m;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> matrix[i][j];
        }
    }
    for (int i = 0; i < n; i++) {
        int sum = 0;
        for (int j = 0; j < m; j++) {
          sum += matrix[i][j];
        }
        for (int j = 0; j < m; j++) {
            if (sum > x) {
                matrix[i][j] = 1;
            }
        }
        for (int j = 0; j < m; j++) {
            if (sum < x) {
                matrix[i][j] = -1;
            }
        }
        for (int j = 0; j < m; j++) {
            if (sum == x) {
                matrix[i][j] = 0;
            }
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cout << matrix[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}