/*
За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви). Нека X e збирот од елементите
под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:

сите елементи од главната дијагонала во матрицата B треба да имаат вредност X

сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y

ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y

сите останати елементи во матрицата B имаат вредност 0

Новата матрица B да се испечати на стандарден излез.
 */
#include <iostream>

using namespace std;

int main () {
    int n;
    float x = 0, y = 0;
    float matrixA[100][100], matrixB[100][100];
    cin >> n;
    for (int i = 0; i < n; i++) {
       for (int j = 0; j < n; j++) {
           cin >> matrixA[i][j];
           matrixB[i][j] = 0;
       }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i > j) {
                x += matrixA[i][j];
            }
            if (j > (n - i - 1)) {
                y += matrixA[i][j];
            }
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if (i == j) {
                matrixB[i][j] = x;
            }
            if (j == (n - i - 1)) {
                matrixB[i][j] = y;
            }
            if ((i == j) && (j == (n - i - 1))) {
                matrixB[i][j] = x + y;
            }
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cout << matrixB[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}