/*
 * Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.

Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број. За секој од нив да се испечати максималната цифра во посебен ред.

Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.

Забелешка: ЗАБРАНЕТО е користење на глобални променливи.
 */
#include <iostream>

using namespace std;

int func (int number, int max) {
    if (number == 0) {
        return max;
    } else {
        if (max < number % 10) {
            max = number % 10;
        }
        return func(number / 10, max);
    }
}


int main () {
    int number;
    while (cin >> number) {
        cout << func(number, 0) << endl;
    }
    return 0;
}