/*
Подреден број е број кај кој секоја следна цифра е поголема или еднаква на претходната (гледајќи од најзначајната кон најмалку значајната). На пример, 12234.

Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура. Потоа се внесуваат N-те броеви,
еден по еден. На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за подреден број, а потоа да се отпечати сумата на сите внесени
Подредени броеви и нивниот број.
 */
#include <iostream>

using namespace std;

int main () {

    return 0;
}