/*
 * Од тастатура се внесуваат 3 производи во формат: цена, тип на данок, каде што цената е внесена како цел број, додека типот на данок се внесува како мала или
 * голема буква, и притоа

тип A или a изнесува 18%
тип B или b изнесува 5%
тип V или v изнесува 0%
Да се испечати вкупното ДДВ кое што треба да се плати за тие производи. ДДВто се пресметува како процент од цената на самиот производ.
 */
#include <iostream>

using namespace std;

int main () {
    int product;
    char type;
    float sum = 0;
    for (int i = 0; i < 3; i++) {
        cin >> product >> type;
        if (type == 'A' || type == 'a') {
            sum += product * 0.18;
        }
        if (type == 'B' || type == 'b') {
            sum += product * 0.05;
        }
        if (type == 'V' || type == 'v') {
            sum += product * 0.0;
        }
    }
    cout << sum;
    return 0;
}