/*
 *Да се напише програма што ќе ја испечати сумата на сите броеви деливи со 3 во интервалот [A,B). А и B се внесуваат од тастатура.

Објаснување на примерот.

А=10, B = 20. Броеви кои припаѓаат во интервалот се 10,11,12,13,..,19. Од нив деливи со 3 се броевите 12,15,18, па нивната сума е 45.
 */
#include <iostream>

using namespace std;

int main () {
    int a, b;
    cin >> a >> b;
    int sum = 0;
    for (int i = a; i <= b; i++) {
        if (i % 3 == 0) {
            sum += i;
        }
    }
    cout << sum;
    return 0;
}