/*
 * Со помош на знаците ‘@’,'%', и ‘.‘ се формира квадратна слика со „должина“ m (m>2) која претставува квадрат од знаците '.', впишан во квадрат од знаците @ и %
 * (види примери). За внесено m да се испечати на екран соодветната слика. Внимавајте – не печатете нити еден дополнителен знак, како празно место, непотребен знак за нов ред...
 * Сликата завршува со знак за нов ред. Забелешка: Бидејќи е дадено ограничување за m, во точно решение на задачата не треба да се користи низа/матрица.
 *
 *
%@@@@@@@@@%
%.........%
%.........%
%.........%
%.........%
%.........%
%.........%
%.........%
%.........%
%.........%
%@@@@@@@@@%

 */
#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;
    for (int i = 0; i < n; i++) {
        cout << "%";
        if (i == 0 || i == n - 1) {
            for (int j = 1; j < n - 1; j++) {
                cout << "@";
            }
        } else {
            for (int j = 1; j < n - 1; j++) {
                cout << ".";
            }
        }
        cout << "%";
        cout << endl;
    }
    return 0;
}